export const COMMON_FIELDS = {
  'UnstructuredName=': 'Неструктурированное имя',
  'E=': 'Email',
  'C=': 'Страна',
  'S=': 'Регион',
  'L=': 'Город',
  'STREET=': 'Адрес',
  'O=': 'Компания',
  'T=': 'Должность',
  'ОГРНИП=': 'ОГРНИП',
  'OGRNIP=': 'ОГРНИП',
  'SNILS=': 'СНИЛС',
  'СНИЛС=': 'СНИЛС',
  'INN=': 'ИНН',
  'ИНН=': 'ИНН',
  'ОГРН=': 'ОГРН',
  'OGRN=': 'ОГРН',
};

export const SUBJECT_FIELDS = {
  'SN=': 'Фамилия',
  'G=': 'Имя/Отчество',
  'CN=': 'Владелец',
  'OU=': 'Отдел/подразделение',
};

export const ISSUER_FIELDS = {
  'CN=': 'Удостоверяющий центр',
  'OU=': 'Тип',
};
